Ran Plan for project: `codedeploy/zerone-id/ap-northeast-2` dir: `terraform/codedeploy/zerone-id/ap-northeast-2` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.terraform_remote_state.demo_tmcdapne2: Reading...
data.terraform_remote_state.iam: Reading...
data.terraform_remote_state.demo_tmcdapne2: Read complete after 1s
data.terraform_remote_state.iam: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_codedeploy_app.demo_app will be created
+ resource "aws_codedeploy_app" "demo_app" {
      + application_id      = (known after apply)
      + arn                 = (known after apply)
      + compute_platform    = "ECS"
      + github_account_name = (known after apply)
      + id                  = (known after apply)
      + linked_to_github    = (known after apply)
      + name                = "demo_app"
      + tags_all            = (known after apply)
    }

  # aws_codedeploy_deployment_config.demo_app will be created
+ resource "aws_codedeploy_deployment_config" "demo_app" {
      + arn                    = (known after apply)
      + compute_platform       = "ECS"
      + deployment_config_id   = (known after apply)
      + deployment_config_name = "demo_app"
      + id                     = (known after apply)

      + traffic_routing_config {
          + type = "AllAtOnce"
        }
    }

  # aws_codedeploy_deployment_group.demo_app will be created
+ resource "aws_codedeploy_deployment_group" "demo_app" {
      + app_name                    = "demo_app"
      + arn                         = (known after apply)
      + compute_platform            = (known after apply)
      + deployment_config_name      = (known after apply)
      + deployment_group_id         = (known after apply)
      + deployment_group_name       = "demo_app"
      + id                          = (known after apply)
      + outdated_instances_strategy = "UPDATE"
      + service_role_arn            = "arn:aws:iam::066346343248:role/service-role/codedeploy-deployment"
      + tags_all                    = (known after apply)

      + auto_rollback_configuration {
          + enabled = true
          + events  = [
              + "DEPLOYMENT_FAILURE",
            ]
        }

      + blue_green_deployment_config {
          + deployment_ready_option {
              + action_on_timeout = "CONTINUE_DEPLOYMENT"
            }
          + terminate_blue_instances_on_deployment_success {
              + action                           = "TERMINATE"
              + termination_wait_time_in_minutes = 5
            }
        }

      + deployment_style {
          + deployment_option = "WITH_TRAFFIC_CONTROL"
          + deployment_type   = "BLUE_GREEN"
        }

      + ecs_service {
          + cluster_name = "demo-tmcdapne2"
          + service_name = "demo-tmcdapne2"
        }

      + load_balancer_info {
          + target_group_pair_info {
              + prod_traffic_route {
                  + listener_arns = [
                      + "arn:aws:elasticloadbalancing:ap-northeast-2:066346343248:listener/app/demo-tmcdapne2/d4fbdd54f5b6eafd/9326d879e91e4c56",
                    ]
                }
              + target_group {
                  + name = "demo-blue"
                }
              + target_group {
                  + name = "demo-green"
                }
              + test_traffic_route {
                  + listener_arns = [
                      + "arn:aws:elasticloadbalancing:ap-northeast-2:066346343248:listener/app/demo-tmcdapne2/d4fbdd54f5b6eafd/11f70fce20751d3a",
                    ]
                }
            }
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ demo_app_codedeploy_app_arn               = (known after apply)
+ demo_app_codedeploy_deployment_config_arn = (known after apply)
+ demo_app_codedeploy_deployment_group_arn  = (known after apply)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p codedeploy/zerone-id/ap-northeast-2`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.terraform.devart.tv/lock?id=DevopsArtFactory%252Fterraform-provisioning%252Fterraform%252Fcodedeploy%252Fzerone-id%252Fap-northeast-2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p codedeploy/zerone-id/ap-northeast-2`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
